---
title: ForgeTypeId
classe: Autodesk.Revit.DB.ForgeTypeId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ForgeTypeId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `forgeTypeId.IsValidObject` | Boolean |
| `String TypeId { get; set; }` | `forgeTypeId.TypeId` | String |
| `ForgeTypeId Clear()` | `forgeTypeId.Clear()` | ForgeTypeId |
| `Void Dispose()` | `forgeTypeId.Dispose()` | Void |
| `Boolean Empty()` | `forgeTypeId.Empty()` | Boolean |
| `Boolean NameEquals(ForgeTypeId)` | `forgeTypeId.NameEquals(other)` | Boolean |
| `Boolean StrictlyEquals(ForgeTypeId)` | `forgeTypeId.StrictlyEquals(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```